Documents/ПередачаЛицензий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПередачаЛицензий</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПередающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПринимающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				
				<Properties>
					<Name>ПередаваемыеПродукты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрационныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ПечатьАктовПередачиЛицензий/Ext/Module.bsl
// Формирование печатной формы акта приема-передачи лицензий по шаблону
// из справочника ШаблоныПередачиЛицензий.
//
// Принцип повторяет типовой механизм печати договоров
// (Справочник.ШаблоныДоговоров + ПечатьДоговоров):
//  - шаблон хранится в реквизите ШаблонХранилище (ХранилищеЗначения)
//    как структура {ТекстHTML, Вложения};
//  - параметры в тексте шаблона записываются в фигурных скобках {ИмяПараметра}
//    и выделяются желтым фоном;
//  - при заполнении параметры заменяются значениями, фон снимается;
//  - незаполненные параметры остаются выделенными.

#Область ПрограммныйИнтерфейс

// Возвращает структуру параметров заполнения текста акта.
//
// Возвращаемое значение:
//   Структура:
//     * СсылкаНаОбъект - ДокументСсылка.ПередачаЛицензий - печатаемый документ
//     * ШаблонАкта     - СправочникСсылка.ШаблоныПередачиЛицензий - шаблон печати
//
Функция СтруктураПараметровПечатиАкта() Экспорт

	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("СсылкаНаОбъект", Неопределено);
	ПараметрыЗаполнения.Вставить("ШаблонАкта", Неопределено);

	Возврат ПараметрыЗаполнения;

КонецФункции

// Заполняет форматированный документ текстом акта по шаблону:
// загружает HTML шаблона и заменяет параметры {ИмяПараметра} на значения реквизитов.
//
// Параметры:
//   ПараметрыЗаполнения - Структура - см. СтруктураПараметровПечатиАкта()
//   ФорматированныйДокумент - ФорматированныйДокумент - заполняемый документ
//
Процедура ЗаполнитьТекстАкта(ПараметрыЗаполнения, ФорматированныйДокумент) Экспорт

	СведенияОбАкте = СведенияОбАкте(ПараметрыЗаполнения.СсылкаНаОбъект);
	Если СведенияОбАкте = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеШаблона = Справочники.ШаблоныПередачиЛицензий.ДанныеШаблона(ПараметрыЗаполнения.ШаблонАкта);
	Если ПустаяСтрока(ДанныеШаблона.ТекстHTML) Тогда
		Возврат;
	КонецЕсли;

	ФорматированныйДокумент.УстановитьHTML(ДанныеШаблона.ТекстHTML, ДанныеШаблона.Вложения);

	ЦветФонаПараметра = ЦветФонаЗаменяемогоПараметра();
	ЦветПоУмолчанию = Новый Цвет(255, 255, 255);

	ОбластьНачалоПараметра = ФорматированныйДокумент.НайтиТекст("{");
	Пока ОбластьНачалоПараметра <> Неопределено Цикл

		ОбластьКонецПараметра = ФорматированныйДокумент.НайтиТекст("}", ОбластьНачалоПараметра.ЗакладкаНачала);
		Если ОбластьКонецПараметра = Неопределено Тогда
			// Нет закрывающей скобки - параметр продолжается до конца текста.
			Прервать;
		КонецЕсли;

		МассивЭлементов = ФорматированныйДокумент.СформироватьЭлементы(
			ОбластьНачалоПараметра.ЗакладкаНачала, ОбластьКонецПараметра.ЗакладкаКонца);

		// Из-за форматирования текст параметра может быть разбит на несколько
		// элементов - собираем в одну строку.
		ИмяПараметра = "";
		Для Каждого ЭлементДокумента Из МассивЭлементов Цикл
			Если ТипЗнч(ЭлементДокумента) = Тип("ТекстФорматированногоДокумента") Тогда
				ИмяПараметра = ИмяПараметра + ЭлементДокумента.Текст;
			КонецЕсли;
		КонецЦикла;

		ИмяПараметра = СтрЗаменить(ИмяПараметра, "{", "");
		ИмяПараметра = СтрЗаменить(ИмяПараметра, "}", "");

		Успешно = Истина;
		Если ЗначениеЗаполнено(ИмяПараметра) Тогда
			Значение = ЗначениеПараметра(ИмяПараметра, СведенияОбАкте, Успешно);
		Иначе
			Значение = "";
		КонецЕсли;

		// Значение подставляем в первый текстовый элемент,
		// остальные текстовые элементы параметра очищаем.
		Подставлено = Ложь;
		ЭлементЗначения = Неопределено;
		Для Каждого ЭлементДокумента Из МассивЭлементов Цикл
			Если ТипЗнч(ЭлементДокумента) <> Тип("ТекстФорматированногоДокумента") Тогда
				Продолжить;
			КонецЕсли;
			Если Не Подставлено Тогда
				ЭлементДокумента.Текст = Значение;
				Подставлено = Истина;
				ЭлементЗначения = ЭлементДокумента;
			Иначе
				ЭлементДокумента.Текст = "";
			КонецЕсли;
		КонецЦикла;

		Если Успешно И ЭлементЗначения <> Неопределено Тогда
			Если ЭлементЗначения.ЦветФона = ЦветФонаПараметра Тогда
				ЭлементЗначения.ЦветФона = ЦветПоУмолчанию;
			КонецЕсли;
		КонецЕсли;

		// Ищем следующий параметр.
		ОбластьНачалоПараметра = ФорматированныйДокумент.НайтиТекст("{", ОбластьНачалоПараметра.ЗакладкаНачала);

	КонецЦикла;

КонецПроцедуры

// Возвращает сведения об акте и сторонах для подстановки в шаблон.
//
// Параметры:
//   СсылкаНаОбъект - ДокументСсылка.ПередачаЛицензий - печатаемый документ
//
// Возвращаемое значение:
//   Структура:
//     * НомерДокумента - Строка
//     * ДатаДокумента - Дата
//     * Автор - Строка - представление автора
//     * СведенияОбОрганизации - Структура - см. БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице()
//     * СведенияОПередающем - Структура - аналогично, по контрагенту передающему
//     * СведенияОПринимающем - Структура - аналогично, по контрагенту принимающему
//     * Продукты - Массив из Строка - строки "1. Продукт, регистрационный номер: ХХХ"
//
Функция СведенияОбАкте(СсылкаНаОбъект) Экспорт

	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПередачаЛицензий.Номер КАК Номер,
	|	ПередачаЛицензий.Дата КАК Дата,
	|	ПередачаЛицензий.Организация КАК Организация,
	|	ПередачаЛицензий.КонтрагентПередающий КАК КонтрагентПередающий,
	|	ПередачаЛицензий.КонтрагентПринимающий КАК КонтрагентПринимающий,
	|	ПередачаЛицензий.Автор КАК Автор,
	|	ПередачаЛицензий.ПередаваемыеПродукты.(
	|		НомерСтроки,
	|		Продукт,
	|		РегистрационныйНомер
	|	) КАК ПередаваемыеПродукты
	|ИЗ
	|	Документ.ПередачаЛицензий КАК ПередачаЛицензий
	|ГДЕ
	|	ПередачаЛицензий.Ссылка = &Ссылка");

	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Сведения = Новый Структура;
	Сведения.Вставить("НомерДокумента", Выборка.Номер);
	Сведения.Вставить("ДатаДокумента", Выборка.Дата);
	Сведения.Вставить("Автор", Строка(Выборка.Автор));

	Сведения.Вставить("СведенияОбОрганизации",
		БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Организация, Выборка.Дата));
	Сведения.Вставить("СведенияОПередающем",
		БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.КонтрагентПередающий, Выборка.Дата));
	Сведения.Вставить("СведенияОПринимающем",
		БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.КонтрагентПринимающий, Выборка.Дата));

	Продукты = Новый Массив;
	ВыборкаПродуктов = Выборка.ПередаваемыеПродукты.Выбрать();
	Пока ВыборкаПродуктов.Следующий() Цикл
		СтрокаПродукта = Формат(ВыборкаПродуктов.НомерСтроки, "ЧГ=") + ". "
			+ СокрЛП(ВыборкаПродуктов.Продукт);
		Если ЗначениеЗаполнено(ВыборкаПродуктов.РегистрационныйНомер) Тогда
			СтрокаПродукта = СтрокаПродукта
				+ ", регистрационный номер: " + СокрЛП(ВыборкаПродуктов.РегистрационныйНомер);
		КонецЕсли;
		Продукты.Добавить(СтрокаПродукта);
	КонецЦикла;
	Сведения.Вставить("Продукты", Продукты);

	Возврат Сведения;

КонецФункции

// Возвращает список параметров шаблона для редактора шаблонов.
//
// Возвращаемое значение:
//   ТаблицаЗначений с колонками:
//     * Имя - Строка - имя параметра без скобок
//     * Представление - Строка - представление для пользователя
//     * Группа - Строка - имя группы параметров
//
Функция ТаблицаПараметровШаблона() Экспорт

	Параметры = Новый ТаблицаЗначений;
	Параметры.Колонки.Добавить("Имя");
	Параметры.Колонки.Добавить("Представление");
	Параметры.Колонки.Добавить("Группа");

	ДобавитьПараметр(Параметры, "НомерДокумента",            НСтр("ru = 'Номер документа'"),                 "Документ");
	ДобавитьПараметр(Параметры, "ДатаДокумента",             НСтр("ru = 'Дата документа'"),                  "Документ");
	ДобавитьПараметр(Параметры, "Автор",                     НСтр("ru = 'Автор документа'"),                 "Документ");
	ДобавитьПараметр(Параметры, "КоличествоПродуктов",       НСтр("ru = 'Количество продуктов'"),            "Документ");
	ДобавитьПараметр(Параметры, "ПередаваемыеПродукты",      НСтр("ru = 'Список передаваемых продуктов'"),   "Документ");

	ДобавитьПараметр(Параметры, "Организация",                       НСтр("ru = 'Организация (кратко)'"),                        "Организация");
	ДобавитьПараметр(Параметры, "ПолноеНаименованиеОрганизации",     НСтр("ru = 'Организация (полное наименование)'"),          "Организация");
	ДобавитьПараметр(Параметры, "ИННОрганизации",                    НСтр("ru = 'ИНН организации'"),                             "Организация");
	ДобавитьПараметр(Параметры, "КППОрганизации",                    НСтр("ru = 'КПП организации'"),                             "Организация");
	ДобавитьПараметр(Параметры, "ОГРНОрганизации",                   НСтр("ru = 'ОГРН организации'"),                            "Организация");
	ДобавитьПараметр(Параметры, "ЮридическийАдресОрганизации",       НСтр("ru = 'Юридический адрес организации'"),               "Организация");
	ДобавитьПараметр(Параметры, "ТелефонОрганизации",                НСтр("ru = 'Телефон организации'"),                         "Организация");
	ДобавитьПараметр(Параметры, "РуководительОрганизации",           НСтр("ru = 'Руководитель организации'"),                    "Организация");
	ДобавитьПараметр(Параметры, "ДолжностьРуководителяОрганизации",  НСтр("ru = 'Должность руководителя организации'"),          "Организация");

	ДобавитьПараметр(Параметры, "КонтрагентПередающий",                          НСтр("ru = 'Передающий (кратко)'"),                    "Передающий");
	ДобавитьПараметр(Параметры, "ПолноеНаименованиеКонтрагентаПередающего",      НСтр("ru = 'Передающий (полное наименование)'"),       "Передающий");
	ДобавитьПараметр(Параметры, "ИННКонтрагентаПередающего",                     НСтр("ru = 'ИНН передающего'"),                        "Передающий");
	ДобавитьПараметр(Параметры, "КППКонтрагентаПередающего",                     НСтр("ru = 'КПП передающего'"),                        "Передающий");
	ДобавитьПараметр(Параметры, "ОГРНКонтрагентаПередающего",                    НСтр("ru = 'ОГРН передающего'"),                       "Передающий");
	ДобавитьПараметр(Параметры, "ЮридическийАдресКонтрагентаПередающего",        НСтр("ru = 'Юридический адрес передающего'"),          "Передающий");
	ДобавитьПараметр(Параметры, "ТелефонКонтрагентаПередающего",                 НСтр("ru = 'Телефон передающего'"),                    "Передающий");
	ДобавитьПараметр(Параметры, "РуководительКонтрагентаПередающего",            НСтр("ru = 'Руководитель передающего'"),               "Передающий");
	ДобавитьПараметр(Параметры, "ДолжностьРуководителяКонтрагентаПередающего",   НСтр("ru = 'Должность руководителя передающего'"),     "Передающий");
	ДобавитьПараметр(Параметры, "ПредставительКонтрагентаПередающего",           НСтр("ru = 'Представитель передающего (должность, ФИО)'"), "Передающий");
	ДобавитьПараметр(Параметры, "ОснованиеПолномочийРуководителяКонтрагентаПередающего", НСтр("ru = 'Основание полномочий руководителя передающего'"), "Передающий");

	ДобавитьПараметр(Параметры, "КонтрагентПринимающий",                          НСтр("ru = 'Принимающий (кратко)'"),                    "Принимающий");
	ДобавитьПараметр(Параметры, "ПолноеНаименованиеКонтрагентаПринимающего",      НСтр("ru = 'Принимающий (полное наименование)'"),       "Принимающий");
	ДобавитьПараметр(Параметры, "ИННКонтрагентаПринимающего",                     НСтр("ru = 'ИНН принимающего'"),                        "Принимающий");
	ДобавитьПараметр(Параметры, "КППКонтрагентаПринимающего",                     НСтр("ru = 'КПП принимающего'"),                        "Принимающий");
	ДобавитьПараметр(Параметры, "ОГРНКонтрагентаПринимающего",                    НСтр("ru = 'ОГРН принимающего'"),                       "Принимающий");
	ДобавитьПараметр(Параметры, "ЮридическийАдресКонтрагентаПринимающего",        НСтр("ru = 'Юридический адрес принимающего'"),          "Принимающий");
	ДобавитьПараметр(Параметры, "ТелефонКонтрагентаПринимающего",                 НСтр("ru = 'Телефон принимающего'"),                    "Принимающий");
	ДобавитьПараметр(Параметры, "РуководительКонтрагентаПринимающего",            НСтр("ru = 'Руководитель принимающего'"),               "Принимающий");
	ДобавитьПараметр(Параметры, "ДолжностьРуководителяКонтрагентаПринимающего",   НСтр("ru = 'Должность руководителя принимающего'"),     "Принимающий");
	ДобавитьПараметр(Параметры, "ПредставительКонтрагентаПринимающего",           НСтр("ru = 'Представитель принимающего (должность, ФИО)'"), "Принимающий");
	ДобавитьПараметр(Параметры, "ОснованиеПолномочийРуководителяКонтрагентаПринимающего", НСтр("ru = 'Основание полномочий руководителя принимающего'"), "Принимающий");

	Возврат Параметры;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает значение параметра шаблона по имени.
//
// Параметры:
//   ИмяПараметра - Строка - имя параметра без скобок, регистр не важен
//   СведенияОбАкте - Структура - см. СведенияОбАкте()
//   Успешно - Булево - выходный: Ложь, если параметр не найден
//
// Возвращаемое значение:
//   Строка - значение для подстановки в шаблон
//
Функция ЗначениеПараметра(ИмяПараметра, СведенияОбАкте, Успешно)

	Имя = ВРег(СокрЛП(ИмяПараметра));
	Успешно = Истина;

	Если Имя = "НОМЕРДОКУМЕНТА" Тогда
		Возврат СведенияОбАкте.НомерДокумента;

	ИначеЕсли Имя = "ДАТАДОКУМЕНТА" Тогда
		Возврат Формат(СведенияОбАкте.ДатаДокумента, "ДЛФ=D");

	ИначеЕсли Имя = "АВТОР" Тогда
		Возврат СведенияОбАкте.Автор;

	ИначеЕсли Имя = "КОЛИЧЕСТВОПРОДУКТОВ" Тогда
		Возврат Формат(СведенияОбАкте.Продукты.Количество(), "ЧГ=");

	ИначеЕсли Имя = "ПЕРЕДАВАЕМЫЕПРОДУКТЫ" Тогда
		Возврат СтрСоединить(СведенияОбАкте.Продукты, Символы.ПС);

	ИначеЕсли Имя = "ОРГАНИЗАЦИЯ" Тогда
		Возврат СведенияОбАкте.СведенияОбОрганизации.СокращенноеНаименование;

	ИначеЕсли СтрНачинаетсяС(Имя, "ПОЛНОЕНАИМЕНОВАНИЕОРГАНИЗАЦИИ") Тогда
		Возврат СведенияОбАкте.СведенияОбОрганизации.ПолноеНаименование;

	ИначеЕсли СтрНачинаетсяС(Имя, "ИНН") И СтрЗаканчиваетсяНа(Имя, "ОРГАНИЗАЦИИ") Тогда
		Возврат СведенияОбАкте.СведенияОбОрганизации.ИНН;

	ИначеЕсли СтрНачинаетсяС(Имя, "КПП") И СтрЗаканчиваетсяНа(Имя, "ОРГАНИЗАЦИИ") Тогда
		Возврат СведенияОбАкте.СведенияОбОрганизации.КПП;

	ИначеЕсли СтрНачинаетсяС(Имя, "ОГРН") И СтрЗаканчиваетсяНа(Имя, "ОРГАНИЗАЦИИ") Тогда
		Возврат СведенияОбАкте.СведенияОбОрганизации.ОГРН;

	ИначеЕсли Имя = "ЮРИДИЧЕСКИЙАДРЕСОРГАНИЗАЦИИ" Тогда
		Возврат СведенияОбАкте.СведенияОбОрганизации.ЮридическийАдрес;

	ИначеЕсли Имя = "ТЕЛЕФОНОРГАНИЗАЦИИ" Тогда
		Возврат СведенияОбАкте.СведенияОбОрганизации.Телефоны;

	ИначеЕсли Имя = "РУКОВОДИТЕЛЬОРГАНИЗАЦИИ" Тогда
		Возврат СведенияОбАкте.СведенияОбОрганизации.РуководительФИО;

	ИначеЕсли Имя = "ДОЛЖНОСТЬРУКОВОДИТЕЛЯОРГАНИЗАЦИИ" Тогда
		Возврат СведенияОбАкте.СведенияОбОрганизации.ДолжностьРуководителяПредставление;

	Иначе
		Возврат ЗначениеПараметраКонтрагента(Имя, СведенияОбАкте.СведенияОПередающем, "ПЕРЕДАЮЩЕГО",
			СведенияОбАкте.СведенияОПринимающем, "ПРИНИМАЮЩЕГО", Успешно);

	КонецЕсли;

КонецФункции

// Возвращает значение параметра контрагента (передающего или принимающего).
Функция ЗначениеПараметраКонтрагента(Имя, СведенияОПередающем, СуффиксПередающего,
		СведенияОПринимающем, СуффиксПринимающего, Успешно)

	Если СтрЗаканчиваетсяНа(Имя, СуффиксПередающего) Тогда
		Сведения = СведенияОПередающем;
		Суффикс = СуффиксПередающего;
	ИначеЕсли СтрЗаканчиваетсяНа(Имя, СуффиксПринимающего) Тогда
		Сведения = СведенияОПринимающем;
		Суффикс = СуффиксПринимающего;
	Иначе
		Успешно = Ложь;
		Возврат ПрочеркДляНезаполненногоПараметра();
	КонецЕсли;

	Если Имя = "КОНТРАГЕНТ" + Суффикс Тогда
		Возврат Сведения.СокращенноеНаименование;

	ИначеЕсли Имя = "ПОЛНОЕНАИМЕНОВАНИЕКОНТРАГЕНТА" + Суффикс Тогда
		Возврат Сведения.ПолноеНаименование;

	ИначеЕсли Имя = "ИННКОНТРАГЕНТА" + Суффикс Тогда
		Возврат Сведения.ИНН;

	ИначеЕсли Имя = "КППКОНТРАГЕНТА" + Суффикс Тогда
		Возврат Сведения.КПП;

	ИначеЕсли Имя = "ОГРНКОНТРАГЕНТА" + Суффикс Тогда
		Возврат Сведения.ОГРН;

	ИначеЕсли Имя = "ЮРИДИЧЕСКИЙАДРЕСКОНТРАГЕНТА" + Суффикс Тогда
		Возврат Сведения.ЮридическийАдрес;

	ИначеЕсли Имя = "ТЕЛЕФОНКОНТРАГЕНТА" + Суффикс Тогда
		Возврат Сведения.Телефоны;

	ИначеЕсли Имя = "РУКОВОДИТЕЛЬКОНТРАГЕНТА" + Суффикс Тогда
		Возврат Сведения.РуководительФИО;

	ИначеЕсли Имя = "ДОЛЖНОСТЬРУКОВОДИТЕЛЯКОНТРАГЕНТА" + Суффикс Тогда
		Возврат Сведения.ДолжностьРуководителяПредставление;

	ИначеЕсли Имя = "ПРЕДСТАВИТЕЛЬКОНТРАГЕНТА" + Суффикс Тогда
		Если ЗначениеЗаполнено(Сведения.ДолжностьРуководителяПредставление)
			И ЗначениеЗаполнено(Сведения.РуководительФИО) Тогда
			Возврат Сведения.ДолжностьРуководителяПредставление + " " + Сведения.РуководительФИО;
		Иначе
			Возврат Сведения.РуководительФИО;
		КонецЕсли;

	ИначеЕсли Имя = "ОСНОВАНИЕПОЛНОМОЧИЙРУКОВОДИТЕЛЯКОНТРАГЕНТА" + Суффикс Тогда
		Возврат ОснованиеПолномочийРуководителя(Сведения);

	Иначе
		Успешно = Ложь;
		Возврат ПрочеркДляНезаполненногоПараметра();

	КонецЕсли;

КонецФункции

// Основание полномочий руководителя: у юридического лица - Устав,
// у индивидуального предпринимателя - свидетельство о регистрации.
Функция ОснованиеПолномочийРуководителя(Сведения)

	Если Сведения.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Возврат НСтр("ru = 'свидетельства о государственной регистрации физического лица в качестве индивидуального предпринимателя'");
	КонецЕсли;

	Возврат НСтр("ru = 'Устава'");

КонецФункции

// Строка-прочерк для незаполненного параметра (остается выделенной в шаблоне).
Функция ПрочеркДляНезаполненногоПараметра()

	Возврат "______________________";

КонецФункции

// Желтый фон заменяемого параметра (как в типовых шаблонах договоров).
Функция ЦветФонаЗаменяемогоПараметра() Экспорт

	Возврат Новый Цвет(255, 236, 139);

КонецФункции

// Добавляет строку в таблицу параметров шаблона.
Процедура ДобавитьПараметр(Параметры, Имя, Представление, Группа)

	Строка = Параметры.Добавить();
	Строка.Имя = Имя;
	Строка.Представление = Представление;
	Строка.Группа = Группа;

КонецПроцедуры

#КонецОбласти
